app/Controllers/CobranzaController.php

    public function index()
    {
        $db= \Config\Database::connect();
        $builder = $db->table('inm_cobranza c');
        $builder->select('c.*,i.codigo_inmueble, u.codigo_unidad, p.codigo_propietario');
        $builder->join('inm_inmueble i', 'i.id_inmueble = c.id_inmueble');
        $builder->join('inm_unidad u', 'u.id_unidad = c.id_unidad');
        $builder->join('inm_propietario p', 'p.id_propietario = c.id_propietario');
        $builder->orderBy('id_cobranza','desc');
        $item['cobranza'] = $builder->get()->getResultArray();
---
SELECT `c`.*, `i`.`codigo_inmueble`, `u`.`codigo_unidad`, `p`.`codigo_propietario`
FROM `inm_cobranza` `c`
JOIN `inm_inmueble` `i` ON `i`.`id_inmueble` = `c`.`id_inmueble`
JOIN `inm_unidad` `u` ON `u`.`id_unidad` = `c`.`id_unidad`
JOIN `inm_propietario` `p` ON `p`.`id_propietario` = `c`.`id_propietario`
ORDER BY `id_cobranza` DESC

    public function buscar($id)
    {
        $contenido = $id;
        $db= \Config\Database::connect();
        $builder = $db->table('inm_cobranza c');
        $builder->select('c.*, u.codigo_unidad,i.codigo_inmueble, iq.nombres, iq.apellidos, p.codigo_propietario');
        $builder->join('inm_unidad u', 'u.id_unidad = c.id_unidad');
        $builder->join('inm_inmueble i', 'i.id_inmueble = c.id_inmueble');
        $builder->join('inm_inquilino iq', 'iq.id_inquilino = c.id_inquilino');
        $builder->join('inm_propietario p', 'p.id_propietario = c.id_propietario');
        $builder->where('c.id_cobranza',$id);
        $item=$builder->get()->getResultArray();
---
SELECT `c`.*, `u`.`codigo_unidad`, `i`.`codigo_inmueble`, `iq`.`nombres`, `iq`.`apellidos`, `p`.`codigo_propietario`
FROM `inm_cobranza` `c`
JOIN `inm_unidad` `u` ON `u`.`id_unidad` = `c`.`id_unidad`
JOIN `inm_inmueble` `i` ON `i`.`id_inmueble` = `c`.`id_inmueble`
JOIN `inm_inquilino` `iq` ON `iq`.`id_inquilino` = `c`.`id_inquilino`
JOIN `inm_propietario` `p` ON `p`.`id_propietario` = `c`.`id_propietario`
WHERE `c`.`id_cobranza` = '1691'